Repository: majerteam/quicklogging
Catalog: locale/*/LC_MESSAGES/README.po
Languages: fr

source: Documentation for quicklogging
fr: Documentation pour quicklogging

source: Resources
fr: Ressources

source: doc: |docs| - read the doc on readthedocs_ (github rst is broken)
fr: doc: |docs| - lire la doc sur readthedocs_ (le rst de github est cassé)

source: source code: on github_
fr: code source sur github_

source: package: |package|
fr: paquet : |package|

source: ci tests: |citests|
fr: tests CI: |citests|

source: What is quicklogging
fr: quicklogging, quesaco ?

source: *quicklogging* is a Python :py:mod:`logging` wrapper to
fr: *quicklogging* est une surcouche au module Python :py:mod:`logging` pour

source: remove a bit of logging boilerplate,
fr: supprimer un peu du du code banal imposé par la journalisation.

source: redirect print output.
fr: rediriger la sortie de print

source: ``quicklogging`` transparently provides a logger with a name relevant to the code at hand:
fr: ``quicklogging`` fournit de façon transparente un logger (journaliseur) nommé de façon pertinente par rapport au code en concerné.

source: The name of the logger is the name of the module making the call.
fr: Le nom du journaliseur est le nom du module effectuant l'appel.

source: For instance, if you log from ``project/models/chair.py``, your logger will be named ``project.models.chair``.
fr: Par exemple, si vous journalisez depuis ``project/models/chair.py``, votre journaliseur sera nommé``project.models.chair``.

source: This is a very important feature:
fr: C'est une fonctionnalité très importante :

source: *Advantage #1 of this naming scheme*
fr: *Avantage n°1 de ce schéma de nommage*

source: the *configuration* of the :py:class:`logging.Logger` s and handlers is much easier —muting, changing verbosity for a particular piece of code etc
fr: la configuration des :py:class:`logging.Logger` s et des sorties (handlers) est beaucoup plus aisée -taire, changer la verbosité d'un morceau donné de code etc

source: *Advantage #2*
fr: *Avantage n°2*

source: we can provide a :py:func:`quicklogging.catch_prints` and a :py:func:`quicklogging.warn_prints` functionality to catch calls to print() from specific modules (typically: the module you're editing).
fr: nous pouvons proposer des fonctionalités :py:func:`quicklogging.catch_prints` (attrape print) et :py:func:`quicklogging.warn_prints` pour attraper les appels à print() depuis des modules spécifiques (en particulier, le module en cours de modification).

source: Licence, original authors
fr: Licence, auteurs originaux

source: MIT (see file ``LICENCE`` ).
fr: MIT (voir fichier ``LICENCE``)

source: authors: majerti_ - Feth AREZKI
fr: auteurs: majerti_ - Feth AREZKI

source: Requirements
fr: Dépendances

source: Python versions
fr: Versions de Python

source: According to travis-ci_ :
fr: D'après travis_ci :

source: Cannot test, but should work because I don't know of API changes:
fr: Non testable, mais devrait fonctionner à ma connaissance : pas de changement d'API.

source: Python 2.7: *testing* NOT ok (Python 2.7 doesn't have :py:class:`importlib.abc.SourceLoader`
fr: Python 2.7 : tests en erreur (Python 2.7 ne propose pas :py:class:`importlib.abc.SourceLoader`

source: Libs required
fr: Bibliothèques requises

source: None ! unless you're running the tests (then you need stringimporter_). . So I've got this easy badge: |requirements|.
fr: Aucune ! à moins que vous ne lanciez les tests. J'ai donc obtenu ce badge très facilement : |requirements|.

source: Doc contents
fr: Contenu de la documentation

source: (if toctree is not displayed, then build the docs with sphinx or read them on readthedocs : |docs|.
fr: (si la table des matières n'est pas affichée ci-dessous, construisez la doc avec sphinx ou lisez-la sur readthedocs : |docs|.
